{
    "posts": [
        {
            "text": "The stationing of peacekeeping troops in Ukraine, as proposed by Britain and France as part of a ceasefire agreement with Russia, is a question for Kyiv to decide and not Moscow, French President Emmanuel Macron says - Reuters",
            "createdAt": "2025-03-16T12:43:57.568Z",
            "language": "en",
            "author": "shipwreck75.bsky.social"
        },
        {
            "text": "Not for Russia to decide on peacekeepers in Ukraine, Macron says",
            "createdAt": "2025-03-16T12:43:27.577Z",
            "language": "en",
            "author": "japantimes.skyfleet.blue"
        },
        {
            "text": "Macron: Europe is preparing for the \"day after\" in Ukraine. France & the UK are finalizing a plan to deploy \"a few thousand troops per nation\" in key areas like Kyiv, Odesa & Lviv for training & long-term support. \n\nNo Russian approval needed — Ukraine is sovereign.",
            "createdAt": "2025-03-16T12:41:18.145Z",
            "language": "en",
            "author": "pen2net.bsky.social"
        },
        {
            "text": "bij de Andere Krant is Lisa Staal er open over dat ze onderdeel is van de haatcampagne die er tegen de week van de lentekriebels wordt gevoerd\n\nzij wil geen revolutie. ze wil de klok terugdraaien \n\nhet is onthutsend dat je een extreemrechts blad moet lezen om te weten wat ze wil",
            "createdAt": "2025-03-16T12:41:07.626Z",
            "language": "en",
            "author": "kutheks.bsky.social"
        },
        {
            "text": "Not for Russia to decide on peacekeepers in Ukraine, Macron says\n\nhttps://www.byteseu.com/834420/\n\nPARIS (Reuters) -The stationing of peacekeeping troops in Ukraine, as proposed by Britain and France as part of a ceasefire agreement with Russia, is a question for Kyiv to decide and not Moscow, …",
            "createdAt": "2025-03-16T12:39:24+00:00",
            "language": "en-US",
            "author": "byteseu.bsky.social"
        },
        {
            "text": "French President Macron said in an interview yesterday the 27 countries in the EU will send \"a few small thousand men per nation, in key points, to do training programs\" in Ukraine. \n\nHow are they not totally ashamed to be this weak? It's a European/Asian war!",
            "createdAt": "2025-03-16T12:36:15.168Z",
            "language": "en",
            "author": "apriljoy.bsky.social"
        },
        {
            "text": "Frisay: Carney became Canada's PM. Monday: Carney to meet Macron in Paris. The shape of the West's post‐US security order",
            "createdAt": "2025-03-16T12:34:29.503Z",
            "language": "en",
            "author": "fheisbourg.bsky.social"
        },
        {
            "text": "Not for Russia to decide on peacekeepers in Ukraine, Macron says",
            "createdAt": "2025-03-16T12:34:19.243Z",
            "language": "en",
            "author": "medical91.bsky.social"
        },
        {
            "text": "Macron is right.",
            "createdAt": "2025-03-16T12:29:06.285Z",
            "language": "en",
            "author": "blueboy1971.bsky.social"
        },
        {
            "text": "\n‼️ Macron does not consider Russia's opinion important on peacekeeping mission in Ukraine\n\n#Military   #Peacekeeping mission   #Ukraine   \n\nhttps://www.pravda.com.ua/eng/news/2025/03/16/7503127/",
            "createdAt": "2025-03-16T12:27:48.471872+00:00",
            "language": "en",
            "author": "nkkln.bsky.social"
        },
        {
            "text": "French President Emmanuel Macron has announced the possibility of deploying European peacekeeping troops to Kyiv, Odesa, and Lviv as part of a strategy to support Ukraine. Macron has insisted on putting “pressure” on Russia to accept the truce in Ukraine. insightnews.media/macron-voice...",
            "createdAt": "2025-03-16T12:26:29.015Z",
            "language": "en",
            "author": "insightnews.bsky.social"
        },
        {
            "text": "Keep it up Macron 💪",
            "createdAt": "2025-03-16T12:19:36.056Z",
            "language": "en",
            "author": "bjornaberger.bsky.social"
        },
        {
            "text": "Well, they're doing their Hitler salute to all of their killings of peoples jobs but then they're also doing that to all the people of Ukraine that they're killing by not supporting the Ukraine. Philadelphia's smart kids don't know who President Macron is and they don't know what's really going on!",
            "createdAt": "2025-03-16T12:16:59.555Z",
            "language": "en",
            "author": "housewife7.bsky.social"
        },
        {
            "text": "Ce n'est pas en bloquant qu'on va résoudre la dette, redonner de la compétitivité et financer une défense. Je ne suis pas pour Macron mais il n'y a pas d'opposition à mon sens stable au niveau des valeurs et de l'économie, alors que vu les comptes à redresser, on est dans la mouise.",
            "createdAt": "2025-03-16T12:14:32.583Z",
            "language": "en",
            "author": "annedgdx.bsky.social"
        },
        {
            "text": "Thank you Mr. President Macron.\n\nIt’s time to remind the world, the traitors and our ennemies what the word EUROPE means. 👇\n\nWe have been the center of the free world for centuries and will remain so for centuries to come",
            "createdAt": "2025-03-16T12:14:07.686Z",
            "language": "en",
            "author": "jokedaniels.bsky.social"
        },
        {
            "text": "Well said macron",
            "createdAt": "2025-03-16T12:10:08.505Z",
            "language": "en",
            "author": "azzow.bsky.social"
        },
        {
            "text": "100% agree with ALL that. \n\nThank God Germany has Merz  and Scholz has buggered off. \n\nNoticeable change in Macron since Scholz left the stage. \n\nNoticeable upping of game by Europe, Canada and Aus. \n\nGermany democracy has worked and European/western solidarity is real (apart from USA).\n\n👍🏼",
            "createdAt": "2025-03-16T12:08:50.931Z",
            "language": "en",
            "author": "willlondon.bsky.social"
        },
        {
            "text": "They make this crap up all the time. Usually to denigrate people that Trump finds threatening. Macron Obama these are all people deep down he wishes he could be like. Narcissist do what a narcissist does. Sad little men",
            "createdAt": "2025-03-16T12:07:49.018Z",
            "language": "en",
            "author": "tenderthought.bsky.social"
        },
        {
            "text": "Macron suggests a plan that does not rely on a ceasefire. He offers a series of steps that will strengthen Ukraine, military and politically, and gains European security. It isn't everything Ukraine needs but is moves us closer to that 'just' peace Ukraine deserves.\nunited24media.com/latest-news/...",
            "createdAt": "2025-03-16T12:07:30.380Z",
            "language": "en",
            "author": "chrissielinnit.bsky.social"
        },
        {
            "text": "In this case, Vlad offered his quick reaction to unfolding events (which is always hard) from a perspective of how to deal with a narcissist, which Macron and Starmer had done well just a few days before. I would have chosen a different perspective, but I can appreciate what Vlad was trying to do.",
            "createdAt": "2025-03-16T12:06:55.809Z",
            "language": "en",
            "author": "anderspucknielsen.dk"
        },
        {
            "text": "So this interview is in English and Owens along with Carlson are saying this wild shit…it was just last September Brigette Macron won a lawsuit because of 2 women misgendering her and accusing her of being male.",
            "createdAt": "2025-03-16T12:06:31.137Z",
            "language": "en",
            "author": "161bklyn.bsky.social"
        },
        {
            "text": "The same rafale already sold to some dictators? Like India leaded by an ex boss of an extremist militia? Qatar, the so dear friend of Hamas? Serbia, always ready to please Putin? Egypt, a good leader in the top 10 of people tortured in prison\nMacron is ready to sold his soul for some of his rafales.",
            "createdAt": "2025-03-16T12:04:15.583Z",
            "language": "en",
            "author": "drjuliamoonwall.bsky.social"
        },
        {
            "text": "#Macron?",
            "createdAt": "2025-03-16T12:03:01.992Z",
            "language": "en",
            "author": "giobbe56.bsky.social"
        },
        {
            "text": "But again, can't the enemy be things like poverty? International issues that liberals might rally for? Cons hold their comic cons every other month with Orban and fucking Manafoet or something in attendance. Where's the libcon with macron and trudeau??",
            "createdAt": "2025-03-16T11:55:20.918Z",
            "language": "en",
            "author": "doctoradmiral.bsky.social"
        },
        {
            "text": "Well said President Macron.",
            "createdAt": "2025-03-16T11:53:08.127Z",
            "language": "en",
            "author": "bradenslen.bsky.social"
        },
        {
            "text": "Burkina Faso, Côte d'Ivoire, Guinea-Bissau, Mali, Niger, Senegal, Togo, Cameroon, Central African Republic, Chad, Republic of the Congo, Equatorial Guinea, Gabon can have total free trade without having to ask permission from Macron first",
            "createdAt": "2025-03-16T11:52:53.849Z",
            "language": "en",
            "author": "talkwithsaul.bsky.social"
        },
        {
            "text": "I agree with Macron: Increase battlefield aid for Ukraine; Strengthening Ukraine’s military structuring; 'Coalition of the Willing' troop deployment; Strengthening european defence. This is a path to 'winning', a 'just' peace, rather than a ceasefire.",
            "createdAt": "2025-03-16T11:52:01.106Z",
            "language": "en",
            "author": "chrissielinnit.bsky.social"
        },
        {
            "text": "And fuck a whole lot more of them before we can make that beautiful idea happen but helas. It's not a Trump thing.. 1962. And Cuba is just an example, there's many more in this awful world of horrors that we call home.Ask macron if .../1",
            "createdAt": "2025-03-16T11:51:35.470Z",
            "language": "en",
            "author": "talkwithsaul.bsky.social"
        },
        {
            "text": "Trump is incapable of achieving peace, not even a truce, with the genocidal socialist Starmer increasingly involved in his war against Russia, and the uk directing massive attacks on Moscow it's impossible. The socialists Starmer and Macron want to drag the EU and the US into their war #Starmer",
            "createdAt": "2025-03-16T11:50:38.212Z",
            "language": "en",
            "author": "pedrovcr.bsky.social"
        },
        {
            "text": "You go, Macron!",
            "createdAt": "2025-03-16T11:50:12.488Z",
            "language": "en",
            "author": "traveler-in-mind.bsky.social"
        },
        {
            "text": "Macron asserts: 'If Kyiv invites allies onto its soil, Moscow has no say'\n\nSource: www.bfmtv.com/internationa...\n\nConversation: www.reddit.com/r/europe/com...\n\n@meidastouch.com @davidpakman.bsky.social @theanthonydavis.bsky.social @briantylercohen.bsky.social @mspopok.bsky.social @aoc.bsky.social",
            "createdAt": "2025-03-16T11:48:40.981Z",
            "language": "en",
            "author": "tehbigmadbarbarian.bsky.social"
        },
        {
            "text": "Trump es incapaz de conseguir la paz, ni siquiera una tregua, con el genocida socialista Starmer cada vez más implicado en SU guerra contra Rusia, reino unido está dirigiendo los ataques masivos a Moscú, es imposible. Los socialistas Starmer y macron quieren arrastrar a SU guerra a la UE y a EE.UU.",
            "createdAt": "2025-03-16T11:48:05.450Z",
            "language": "en",
            "author": "pedrovcr.bsky.social"
        },
        {
            "text": "I don't care if she is male, female or marsian - Macron loves her!\nMind your own business!",
            "createdAt": "2025-03-16T11:47:12.192Z",
            "language": "en",
            "author": "klauslorenzen.bsky.social"
        },
        {
            "text": "dear Ignorant Vance\n\nGermany doesn't need to be saved by America \n\nYou continue to prove President Macron point though. \n\nTrump's America unreliable \n\nBy the way Europe is strengthening and tackling it's migration problem & laws now",
            "createdAt": "2025-03-16T11:43:47.531Z",
            "language": "en",
            "author": "politicaloddball.bsky.social"
        },
        {
            "text": "For Xi, EU ≠ Europe. Xi is looking for opportunities by engaging individual governments at the expense of the EU. During his last visit to the continent, he bypassed Brussels and chose to meet Macron instead. 1/",
            "createdAt": "2025-03-16T11:42:31.738Z",
            "language": "en",
            "author": "hashchange.bsky.social"
        },
        {
            "text": "Russia regains strength even from scraps of burning embers during ceasefires. They've done this in the past during the Chechen Wars. Kudos to Macron.",
            "createdAt": "2025-03-16T11:41:16.716Z",
            "language": "en",
            "author": "borikua4ukr.bsky.social"
        },
        {
            "text": "Macron should be getting the Nobel Peace Prize with the other European leaders.",
            "createdAt": "2025-03-16T11:37:15.029Z",
            "language": "en",
            "author": "dianewpb.bsky.social"
        },
        {
            "text": "Macron has really come into himself with this war. He made a fool of himself at the start, or he allowed Putin to make a fool of him... but he has understood the game, this time. He also recognises that the US has abandoned Europe and is untrustworthy.",
            "createdAt": "2025-03-16T11:34:06.710Z",
            "language": "en",
            "author": "chrissielinnit.bsky.social"
        },
        {
            "text": "🇪🇺🇺🇦 Macron: Europe Can Send Troops to Ukraine Without Russia’s Consent\n\nMacron stated that European countries willing to deploy troops to Ukraine can do so without Russia’s approval. \nHe added that Ukraine is sovereign and has the right to request allied forces on its territory.",
            "createdAt": "2025-03-16T11:33:44.429Z",
            "language": "en",
            "author": "conflictdispatch.bsky.social"
        },
        {
            "text": "She is on sea trials. It's her first sail across the pond. Nothing more to it than that. Perhaps a tiny bit of unity symbolism from Macron. I'd like to think so. \nWe are NOT buying Nuc subs. We don't have the facilities to maintain them. Period!",
            "createdAt": "2025-03-16T11:32:33.605Z",
            "language": "en",
            "author": "marc55.bsky.social"
        },
        {
            "text": "Macron never dreamed of doing the cuts that Labour is doing now, his reforms were way milder than this. The French welfare state remains deeply more solid than the British one.",
            "createdAt": "2025-03-16T11:30:00.384Z",
            "language": "en",
            "author": "nicolekidmansnose.bsky.social"
        },
        {
            "text": "Macron wants 'clear pressure' on Moscow to accept ceasefire\n\nwww.rawstory.com/x-open-the-d...",
            "createdAt": "2025-03-16T11:29:20.810Z",
            "language": "en",
            "author": "pulsa8.bsky.social"
        },
        {
            "text": "Thank you for this clear words, Mr. Macron! 🙏",
            "createdAt": "2025-03-16T11:27:21.324Z",
            "language": "en",
            "author": "uteleschke.bsky.social"
        },
        {
            "text": "#Raisina @ndtv.com @indianexpress.com  @malayalmanorama.bsky.social @karnatakamirror.bsky.social @gujaratijagran.bsky.social @gujaratfirst.bsky.social @thekolkatabuzz.bsky.social  @tnilive.bsky.social @indiatvenglish.bsky.social\n\nMacron is Rotchild!\nMaersk is Blackrock!😱\n\n#India needs new Kanstusan.",
            "createdAt": "2025-03-16T11:25:49.918Z",
            "language": "en",
            "author": "worldguru.bsky.social"
        },
        {
            "text": "\"Ukraine is sovereign. If it asks allied forces to be on its territory,  it is not for Russia to accept or not\" - President Macron.\n\nSeveral more points from President Macron's interview yesterday, ahead of the virtual \"coalition of the willing\" meeting:",
            "createdAt": "2025-03-16T11:25:00.419Z",
            "language": "en",
            "author": "antongerashchenko.bsky.social"
        },
        {
            "text": "/3\nHe also noted Volodymyr #Zelenskyy ’s willingness to resume talks with Donald Trump and the proposal for a 30-day ceasefire.\n\n“For a lasting peace, Ukraine must stand firm and have a strong army. We must be ready to guarantee this peace,” Macron concluded. t.me ⬇️",
            "createdAt": "2025-03-16T11:23:30.653Z",
            "language": "en",
            "author": "margareterosali.bsky.social"
        },
        {
            "text": "/2\nMacron stated after a video conference on security in Ukraine.\nThe French leader emphasized that the “strategy of peace through strength” is under threat and that a ceasefire requires clear and unified pressure from the EU and the US.⬇️",
            "createdAt": "2025-03-16T11:23:30.652Z",
            "language": "en",
            "author": "margareterosali.bsky.social"
        },
        {
            "text": "Good morning☕ at #Bluesky💙💛-\ntruth-\n#France\n\n\" #Russia is not demonstrating a sincere desire for peace\"\nPresident Emmanuel #Macron \n\n“Russia is not responding to the proposals of the #US and #Ukraine but is only intensifying hostilities. #Putin wants to get everything and then negotiate” \n\n1/5",
            "createdAt": "2025-03-16T11:23:30.651Z",
            "language": "en",
            "author": "margareterosali.bsky.social"
        },
        {
            "text": "@lemonde.fr @newsmax.com @thetimes.com @dwnewstoday.bsky.social @independent.ie @spiegel.de @cnn.com @bbcnewsnight.bsky.social @londoncentric.media @postopinions.bsky.social @cbcnews.ca #MAGA @japantimes.co.jp #Trump\n\nOmeingott\nZee Blackrock!\nMacron is Rotchild!\nFreidrish Maersk ⬇️ is Blackrock! 😱",
            "createdAt": "2025-03-16T11:20:03.039Z",
            "language": "en",
            "author": "worldguru.bsky.social"
        },
        {
            "text": "If Carlson thinks Brigitte Macron is a man, what does he think of Marjorie Taylor Greene?",
            "createdAt": "2025-03-16T11:19:27.025Z",
            "language": "en",
            "author": "earlgrey765.bsky.social"
        },
        {
            "text": "This week in The French Dispatch🇫🇷\n\n🏉France win Six Nations Rugby Championship\n🇷🇺 Macron underlines that France doesn’t need Russian consent\n🇪🇺EU military powers call for looser regulation\n👨‍💼Wauquiez re-announces presidential candidature\n\nwww.frenchdispatch.eu/p/wd-champio...",
            "createdAt": "2025-03-16T11:16:49.920Z",
            "language": "en",
            "author": "frenchdispatch.eu"
        },
        {
            "text": "This week in The French Dispatch🇫🇷\n\n🏉France win Six Nations Rugby Championship\n🇷🇺 Macron underlines that France doesn’t need Russian consent\n🇪🇺EU military powers call for looser regulation\n👨‍💼Wauquiez re-announces presidential candidature\n\nwww.frenchdispatch.eu/p/wd-champio...",
            "createdAt": "2025-03-16T11:16:14.225Z",
            "language": "en",
            "author": "julienhoez.eu"
        },
        {
            "text": "Thank you mr. Macron. Thank you France 🇫🇷",
            "createdAt": "2025-03-16T11:11:52.085Z",
            "language": "en",
            "author": "d3xfella.bsky.social"
        },
        {
            "text": "Macron n'a jamais été jeune. Même à 14 ans c'était un vieux",
            "createdAt": "2025-03-16T11:09:25.571Z",
            "language": "en",
            "author": "pantshee.bsky.social"
        },
        {
            "text": "\"Ukraine is a sovereign state, and if it asks allied forces to be on its territory, it is not Russia's business whether to allow it or not.\" - French Pres. Emmanuel Macron\n\n#OSINT #Russia #UkraineWar\n\n#PutinIsAWarCriminal",
            "createdAt": "2025-03-16T10:57:48.864Z",
            "language": "en",
            "author": "urikikaski.bsky.social"
        },
        {
            "text": "De traditie die Macron voortzet is dat de hele wereld slechts bestaat uit buurlanden van Frankrijk.",
            "createdAt": "2025-03-16T10:55:32.920Z",
            "language": "en",
            "author": "janenzl.bsky.social"
        },
        {
            "text": "Russia has no say in the issue of European peacekeepers on the territory of Ukraine, Macron said in an interview with Le Parisien\n\n\"Ukraine is a sovereign state, and if it asks for allied troops to be on its territory, it is not Russia's business to accept them or not,\" the French president reminded",
            "createdAt": "2025-03-16T10:54:31.236Z",
            "language": "en",
            "author": "kolibri93.bsky.social"
        },
        {
            "text": "Iqaluit being his first domestic visit is exactly the right move. Elbows up 🇨🇦 to save the Arctic.\n\n\"Carney is expected to meet with French President Emmanuel Macron, British Prime Minister Keir Starmer, King Charles III, and Nunavut Premier PJ Akeeagok.\"\ncabinradio.ca/228179/news/...",
            "createdAt": "2025-03-16T10:51:13.258Z",
            "language": "en",
            "author": "edgeoerin.com"
        },
        {
            "text": "Macron: \"Those who buy Patriot systems should be offered the new generation Franco-Italian SAMP/T. Those who buy F-35s should be offered Rafale.\"\nRight, independence from US weapons. That our money supports EU industry.",
            "createdAt": "2025-03-16T10:46:43.967Z",
            "language": "en",
            "author": "mau1414.bsky.social"
        },
        {
            "text": "Love it! 👏👏 To France and Pres Macron!!",
            "createdAt": "2025-03-16T10:45:56.853Z",
            "language": "en",
            "author": "hjnaude.bsky.social"
        },
        {
            "text": "www.cnn.com/2025/03/16/e...\nAnother situation due to Trump:\n\"One thing that the Europeans don’t have is nuclear culture. They don’t understand it because they’ve always presumed that the Americans would do it...I suspect that Macron is thinking of... educating whoever wants it, on nuclear dialogue.”",
            "createdAt": "2025-03-16T10:44:08.478Z",
            "language": "en",
            "author": "arcticfox87.bsky.social"
        },
        {
            "text": "Just so bizarre that Labour seems to have looked at France being closer than ever to the far-right getting in after Macron gobbled up the centre-right & abused the left's willingness to vote tactically and decided; \"looks great, where do we sign up?\"",
            "createdAt": "2025-03-16T10:43:58.879Z",
            "language": "en",
            "author": "willcooling.bsky.social"
        },
        {
            "text": "Macron, Glucksmann, Philippe, Bertrand, Attal, Hollande, Cazeneuve, Retailleau, Darmanin, Pécresse, Wauquiez, Bardella, ça en fait du monde à droite pour la Présidentielle. Ils peuvent pas se mettre d'accord entre eux vu qu'ils pensent tous pareil sur tout ?",
            "createdAt": "2025-03-16T10:42:33.471Z",
            "language": "en",
            "author": "marx-dorcel.bsky.social"
        },
        {
            "text": "French President Emmanuel Macron has also weighed in, saying that Putin is \"escalating the fighting\" and \"wants to get everything, then negotiate.\"",
            "createdAt": "2025-03-16T10:42:14.993226+00:00",
            "language": "en",
            "author": "newshoundai.bsky.social"
        },
        {
            "text": "I don’t know from where has Macron found his balls. But he could certainly share that info to Nato secretary-general Mark Rutte.",
            "createdAt": "2025-03-16T10:42:10.902Z",
            "language": "en",
            "author": "slemmy69.bsky.social"
        },
        {
            "text": "Macron asserts: 'If Kyiv invites allies onto its soil, Moscow has no say",
            "createdAt": "2025-03-16T10:32:31.337Z",
            "language": "en",
            "author": "eur-opa.bsky.social"
        },
        {
            "text": "\"Those who buy #Patriot systems should be offered the new generation Franco-Italian SAMP/T. Those who buy F-35s should be offered #Rafale\" - #Macron.\nI would just add \"Those who buy F-35s should also be offered Gripen\". \n#Sweden #France #EU #US",
            "createdAt": "2025-03-16T10:23:11.828Z",
            "language": "en",
            "author": "brianiselin.bsky.social"
        },
        {
            "text": "In a world of Trumps be a Macron!",
            "createdAt": "2025-03-16T10:14:53.723Z",
            "language": "en",
            "author": "cophoto.bsky.social"
        },
        {
            "text": "Fully agreed with the President of the V'th Republic Emmanuel Macron @elysee-france.bsky.social! \"La Russie n'a pas son mot à dire si l'Ukraine \"demande à des forces alliées d'être sur son territoire\" en garantie d'un accord de paix. \" www.francetvinfo.fr/monde/europe... via @franceinfo.fr",
            "createdAt": "2025-03-16T10:10:57.387Z",
            "language": "en",
            "author": "veikospolitis.bsky.social"
        },
        {
            "text": "Macron n'était pas mon candidat, mais il y a des choses qu'on ne doit pas politiser. C'est le cas notamment de la sécurité nationale, et par extension celle de l'Europe.",
            "createdAt": "2025-03-16T10:10:34.827Z",
            "language": "en",
            "author": "vivienschmitt.bsky.social"
        },
        {
            "text": "Russia is not demonstrating a sincere desire for peace, Macron said.\n“Russia is not responding to the proposals of the United States and Ukraine but is only intensifying hostilities. Putin wants to get everything and then negotiate,” Macron stated after a video conference on security in Ukraine.",
            "createdAt": "2025-03-16T10:08:21.112Z",
            "language": "en",
            "author": "danceswithducks.bsky.social"
        },
        {
            "text": "Macron n'a pas dit \"l'argent magique existe\", il va devoir financer par l'emprunt à un moment qui ne nous arrange carrément pas, vu qu'on est fauchés (et que son gouvernement y est pour quelque chose!) . Le front populaire n'était pas au pouvoir en temps de guerre.",
            "createdAt": "2025-03-16T10:07:07.138Z",
            "language": "en",
            "author": "annedgdx.bsky.social"
        },
        {
            "text": "Surtout que tu serais bredouille à la pêche...\nEn ce moment, tout le monde dit que Macron, et la France en général avait raison depuis des années, et qu'on est le seul recours contre les Russo-Américains.\nCe n'est pas rien.",
            "createdAt": "2025-03-16T10:04:15.362Z",
            "language": "en",
            "author": "chtiwaz.bsky.social"
        },
        {
            "text": "I wanna trade Rutte for Macron please :P",
            "createdAt": "2025-03-16T09:54:36.164Z",
            "language": "en",
            "author": "avultink.bsky.social"
        },
        {
            "text": "Starmer should grow a pair speak to G7 and raise wealth tax like Macron did. Blackrock Merz should do the same here. www.theguardian.com/society/2025...",
            "createdAt": "2025-03-16T09:50:06.006Z",
            "language": "en",
            "author": "nes-tor.bsky.social"
        },
        {
            "text": "Macron wants 'clear pressure' on Moscow to accept ceasefire www.rawstory.com/x-open-the-d...",
            "createdAt": "2025-03-16T09:44:14.365Z",
            "language": "en",
            "author": "darbyscastle.bsky.social"
        },
        {
            "text": "If Russia Does Not Sincerely Commit To Peace...: Macron On Ceasefire\n->NDTV | #RussiaUkraineWar #Peace | More info from EcoSearch",
            "createdAt": "2025-03-16T09:36:02.681869+00:00",
            "language": "en",
            "author": "bigearthdata.bsky.social"
        },
        {
            "text": "France is considering Ukraine's request for the supply of remotely controlled missiles and drones – Le Parisien\n\nUkrainian President Volodymyr Zelenskyy, in a conversation with his French counterpart Emmanuel Macron, requested remotely controlled missiles and drones for the Defense Forces.",
            "createdAt": "2025-03-16T09:31:03.914Z",
            "language": "en",
            "author": "anno1540.bsky.social"
        },
        {
            "text": "Je crois que toute cette agitation fait au contraire beaucoup de bien à la démocratie. \n\nDes peuples européens veulent le départ de dirigeants qui ne les représentent pas. \n\nDes voix s’élèvent en Europe. Macron prend le lead.",
            "createdAt": "2025-03-16T09:28:52.880Z",
            "language": "en",
            "author": "jokedaniels.bsky.social"
        },
        {
            "text": "Je fatigue de plus en plus de la FI et de Melenchon, mais y a toujours pas de débat là dessus pour moi. Glucksmann, c’est la continuité de notre bourbier, je ne l’imagine pas un instant dévier de la trajectoire de Hollande et Macron",
            "createdAt": "2025-03-16T09:26:11.367Z",
            "language": "en",
            "author": "jacques-falafel.bsky.social"
        },
        {
            "text": "From what I read, there's nowhere near enough missiles & they are slow to produce.\n\nI believe Macron wants to up production, of course. It should be a priority build, IMO.\n\nwww.forbes.com/sites/davida...",
            "createdAt": "2025-03-16T09:26:10.603Z",
            "language": "en",
            "author": "rgrhistorian.bsky.social"
        },
        {
            "text": "And to bring it closer to a reinvigorated European Union. We're seeing people like Trudeau followed by Carney, Macron, Von der Leyen and even Starmer at their best.",
            "createdAt": "2025-03-16T09:24:36.304Z",
            "language": "en",
            "author": "davidnice.bsky.social"
        },
        {
            "text": "Aubry (PS) applaudit aux sommes versées pour la guerre. Glucksmann glappit avec Macron: \"A l'assaut de l'Est!\". En Belgique, Th. Dermine bourgmestre PS de Charleroi voit l'avenir de la Wallonie dans l'industrie de guerre. Retailleau, copie conforme de Macron, sera élu.\nwww.lecho.be/economie-pol...",
            "createdAt": "2025-03-16T09:24:22.436Z",
            "language": "en",
            "author": "elmored1.bsky.social"
        },
        {
            "text": "Giorgia Meloni will continue to walk a tightrope on this.\n\nOn the one hand, having worked hard to make Italy look like a major international player under her govt, she would absolutely hate to see Macron + Starmer doing it alone (if it ever comes to it).\n\nkyivindependent.com/italy-does-n...",
            "createdAt": "2025-03-16T09:21:19.495Z",
            "language": "en",
            "author": "dralbertazziuk.bsky.social"
        },
        {
            "text": "French President Emmanuel Macron will host Canadian Prime Minister Mark Carney for a meeting in Paris on Monday in Carney's first foreign visit since taking office, Macron's office said on Saturday.",
            "createdAt": "2025-03-16T09:13:09.196Z",
            "language": "en",
            "author": "katherinestiles.bsky.social"
        },
        {
            "text": "❗️ President of 🇫🇷France Macron: \"Those who buy Patriot systems should be offered the new generation Franco-Italian SAMP/T. Those who buy F-35s should be offered Rafale.\"",
            "createdAt": "2025-03-16T09:11:06.013Z",
            "language": "en",
            "author": "militarynewsua.bsky.social"
        },
        {
            "text": "Macron rising to the occasion is reviving my SOUL.",
            "createdAt": "2025-03-16T09:09:44.669Z",
            "language": "en",
            "author": "animagenic.bsky.social"
        },
        {
            "text": "Great leadership by Starmer & Macron.",
            "createdAt": "2025-03-16T09:01:37.772Z",
            "language": "en",
            "author": "kartykarts.bsky.social"
        },
        {
            "text": "Oh absolutely. And it’s in this case a lie about Brigitte Macron (which I daresay is also fuelled by ageism). Vile.",
            "createdAt": "2025-03-16T08:54:47.550Z",
            "language": "en",
            "author": "hagenilda.bsky.social"
        },
        {
            "text": "🇫🇷 Macron: Europe is preparing for the \"day after\" in Ukraine. France & the UK are finalizing a plan to deploy \"a few thousand troops per nation\" in key areas like Kyiv, Odesa & Lviv for training & long-term support. No Russian approval needed—Ukraine is sovereign.\n\nwww.leparisien.fr/politique/tr...",
            "createdAt": "2025-03-16T08:52:46.037Z",
            "language": "en",
            "author": "noelreports.com"
        },
        {
            "text": "Macron urges French manufacturers to increase production of weapons to replace American ones in the arms market - Le Parisien\n\n\"Those who buy Patriot missiles should be offered the new generation Franco-Italian SAM-T; those who buy F-35 should be offered Rafale,\" the statement said.",
            "createdAt": "2025-03-16T08:51:07.534Z",
            "language": "en",
            "author": "kolibri93.bsky.social"
        },
        {
            "text": "That’s the worst he can say about Macron??😂😂 this guy has a brain the size of a mosquito",
            "createdAt": "2025-03-16T08:40:36.164Z",
            "language": "en",
            "author": "emaj7th.bsky.social"
        },
        {
            "text": "🇫🇷 In an interview broadcast by several regional newspapers on March 15, the President of the Republic, Emmanuel Macron, announced  \"an overhaul of the Universal National Service (SNU), so that it corresponds to the needs of the nation and the priorities that we have identified.\n[Franceinfo]",
            "createdAt": "2025-03-16T08:37:08.103Z",
            "language": "en",
            "author": "jumblerates.bsky.social"
        },
        {
            "text": "📢 （法新社巴黎15日电）    法国总统马克宏（Emmanuel Macron）今天表示，欧洲和美国必须向俄罗斯施压，使其接受乌克兰停火协议。马克宏在声明中说，俄罗斯「并未给人诚�迪Ｍ�和平的印象」。\n\n👉40+您感兴趣的媒体 ",
            "createdAt": "2025-03-16T08:31:31.034181+00:00",
            "language": "en",
            "author": "rfichinese.nzcow.com"
        },
        {
            "text": "🇪🇺🇫🇷🇺🇦 Macron said that several EU countries are already interested in the initiative to deploy soldiers in Ukraine, the purpose of which is to train soldiers and demonstrate long-term support. \n\n❗️In military scenarios, we are talking about deploying peacekeepers in Kyiv, Odesa, Lviv.",
            "createdAt": "2025-03-16T08:25:22.993Z",
            "language": "en",
            "author": "theukrainianreview.bsky.social"
        },
        {
            "text": "Macron be like 😎",
            "createdAt": "2025-03-16T08:22:39.259Z",
            "language": "en",
            "author": "prescientmofo.bsky.social"
        },
        {
            "text": "I know, but you should stand by your values. Macron handled a similar situation quite well.",
            "createdAt": "2025-03-16T08:19:45.991Z",
            "language": "en",
            "author": "miskanuutinen.bsky.social"
        },
        {
            "text": "“L’Ukraine est souveraine, si elle demande à des forces alliées d’être sur son territoire, ce n’est pas à la Russie d’accepter ou pas.” — Emmanuel Macron\n\nÇa résume la différence entre Trump qui joue dans le camp de Poutine et la team Macron-Starmer qui soutiennent Zelenskyy.",
            "createdAt": "2025-03-16T08:15:10.644Z",
            "language": "en",
            "author": "jf.porchez.com"
        },
        {
            "text": "There were also massive protests in London. It's exactly what the Americans need to do. Can you imagine how the French would react if Macron tried the shit Trump is doing? Paris would be burning.",
            "createdAt": "2025-03-16T08:06:33.955Z",
            "language": "en",
            "author": "dr-negrin.bsky.social"
        },
        {
            "text": "Macron to putin:",
            "createdAt": "2025-03-16T07:57:35.710Z",
            "language": "en",
            "author": "ash9001.bsky.social"
        }
    ]
}